{
    "comments": [
      {
        "username": "DarkSoul1987",
        "comment": "This game gave me chills! The atmosphere is insane. Did anyone else notice the hidden figure in the mirror at 2:34?"
      },
      {
        "username": "NightmareSeeker",
        "comment": "Bro, those jump scares are on point! I nearly fell out of my chair! Also, is that the same music from the developer's old game hidden in the background?"
      },
      {
        "username": "GothicGamer06",
        "comment": "The lighting and sound design are top-notch. Really pulls you in! Also, did you see that creepy doll in the corner at 5:17? Definitely an easter egg!"
      },
      {
        "username": "SilentScream92",
        "comment": "This gameplay is so intense! I was on the edge of my seat the whole time. Btw, love the reference to 'The Shining' at 3:42!"
      },
      {
        "username": "CreepyCrawler",
        "comment": "Damn, this game looks terrifying. The pacing is perfect for a horror game. And did anyone catch that hidden message in the static noise?"
      },
      {
        "username": "ShadowsInTheDark",
        "comment": "I love how immersive the environment is. You feel like you're right there! That secret room behind the bookshelf at 12:45 was so cool!"
      },
      {
        "username": "HauntedSoul777",
        "comment": "The storytelling in this game is incredible! So dark and mysterious. Did you hear the creepy whispering at 6:23? Gave me goosebumps!"
      },
      {
        "username": "ScareMaster2007",
        "comment": "I'm not even playing and I feel scared watching this! Great work. That ghost in the background at 9:15 was subtle but so creepy!"
      },
      {
        "username": "GhostHunterX",
        "comment": "The tension builds up so well in this game. It's like a movie but scarier! Btw, anyone else notice the '404 Error' graffiti at 10:08? LOL!"
      },
      {
        "username": "FearFang",
        "comment": "These graphics are unreal for a horror game from this era! And the way you found that hidden key at 8:34, pure genius!"
      },
      {
        "username": "GraveyardShift",
        "comment": "The sound effects make this game SO creepy. I'm literally shaking. Oh, and the hidden message in the painting at 11:29? Chilling!"
      },
      {
        "username": "ShadowStalker",
        "comment": "That monster design is just terrifying. Hats off to the devs! Also, that hidden hallway at 7:52? Thought I was imagining things!"
      },
      {
        "username": "BloodMoonRising",
        "comment": "The jump scares are perfectly timed. Can't wait to play this myself. And the secret level you unlocked? Insane!"
      },
      {
        "username": "TerrorLurker",
        "comment": "This game nails the horror vibe. I can’t believe I missed it back in the day! Did anyone else see that figure in the window at 4:18? Totally missed it on my first watch!"
      },
      {
        "username": "UnderworldSlayer",
        "comment": "Wow, the AI in this game is brutal. Makes it even more terrifying. Also, love the subtle nod to 'Resident Evil' with the typewriter at 3:05!"
      },
      {
        "username": "PhantomEyes",
        "comment": "I love how the atmosphere builds slowly and then suddenly scares the life out of you! The hidden room you unlocked at 6:47? Creepiest moment ever."
      },
      {
        "username": "ChillzToTheBone",
        "comment": "The ambient music is perfect for setting up the horror. Loving this gameplay! Btw, that cryptic code on the wall at 7:19? Wonder what it means!"
      },
      {
        "username": "HorrorKing07",
        "comment": "This gameplay footage is amazing! Totally worth the watch. The tension is unreal. Anyone else spot the hidden skull in the fireplace at 5:33?"
      },
      {
        "username": "SinisterWings",
        "comment": "I'm not brave enough to play this, but watching it is seriously entertaining. That easter egg referencing the developer’s last game at 2:55? Epic!"
      },
      {
        "username": "GhostlyGamer",
        "comment": "The way you handled that boss fight was epic! Great playthrough. Also, that old-school game poster in the background at 9:09? Awesome nod!"
      }
    ]
  }
  